diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ТекСтр = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.ДатаОкончания) Тогда
		ТекСтр.КоличествоДней = (КонецДня(ТекСтр.ДатаОкончания) - НачалоДня(ТекСтр.ДатаНачала)) /60 /60 /24;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекСтр = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.ДатаНачала) Тогда
		ТекСтр.КоличествоДней = (КонецДня(ТекСтр.ДатаОкончания) - НачалоДня(ТекСтр.ДатаНачала)) /60 /60 /24;
	КонецЕсли;
КонецПроцедуры

	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтруктураПараметров,,УникальныйИдентификатор);

//	АдресГрафикаВХранилище = ПоместитьДанныеВоВременноеХранилище();
//	СтруктураПараметров = Новый Структура("АдресГрафикаВДокументе", АдресГрафикаВХранилище);
//	ФормаДГанта = ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", СтруктураПараметров, ЭтотОбъект);
//	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
	Возврат Адрес;
КонецФункции
#КонецОбласти
